Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/FileUploadSubsidiaries/AllSubsidiariesList.*.resx
Languages: cy

source: Adding and removing subsidiaries
cy: Ychwanegu a thynnu is-gwmnïau

# before_you_upload
source: Before you upload your file, make sure you're using the latest version of the
cy: Cyn ichi uwchlwytho'ch ffeil, gofalwch eich bod yn defnyddio fersiwn diweddaraf

source: Companies House number
cy: Rhif Tŷ'r Cwmnïau

source: Create subsidiary IDs
cy: Creu IDs is-gwmnïau

source: Download subsidiaries list
cy: Lawrlwytho rhestr is-gwmnïau

source: Joined
cy: W Joined

source: No CH Number
cy: W No CH Number

# remove_subsidiary
source: Remove
cy: Tynnu

source: Reporting
cy: W Reporting

# return_to_account_home
source: Account home
cy: W Account home

source: Subsidiaries
cy: Is-gwmnïau

source: Subsidiaries list
cy: Rhestr is-gwmnïau

# subsidiaries_need_to_upload_csv
source: To add subsidiaries you will need to upload a CSV file.
cy: W To add subsidiaries you will need to upload a CSV file.

# subsidiaries_not_found
source: Subsidiary not found
cy: W Subsidiary not found

# subsidiaries_will_appear
source: Subsidiaries will appear here after they have been processed.
cy: W Subsidiaries will appear here after they have been processed.

# subsidiary_accuracy_warning_text
source: Check all the information you have provided is accurate. If any of it is incorrect or incomplete, you will need to provide the correct information. Use the subsidiary IDs for all future organisation details and packaging data submissions.
cy: Gwiriwch fod yr holl wybodaeth rydych chi wedi'i darparu yn gywir. Os nad yw'n gywir neu os oes unrhyw wybodaeth ar goll, bydd angen ichi ddarparu'r data cywir. Defnyddiwch IDs yr is-gwmnïau ar gyfer holl fanylion y sefydliad a phob cyflwyniad data pecynwaith yn y dyfodol.

# subsidiary_file_template
source: subsidiary file template (opens in a new tab)
cy: templed y ffeil is-gwmnïau (yn agor mewn tab newydd)

source: Subsidiary ID
cy: ID yr is-gwmni

source: Subsidiary name
cy: Enw'r is-gwmni

# text_assistive.warning
source: Warning
cy: Rhybudd

# to_add_or_remove
source: To add or remove subsidiaries, you must
cy: I ychwanegu neu dynnu is-gwmnïau, rhaid ichi

# update_and_resubmit
source: update and resubmit your registration file
cy: ddiweddaru ac ailgyflwyno'ch ffeil gofrestru

source: Upload subsidiary file
cy: Uwchlwytho ffeil is-gwmnïau

# use_the_file_upload
source: Use the file upload to create subsidiary IDs – you will need these subsidiary IDs to add subsidiaries to your organisation.
cy: Defnyddiwch uwchlwytho ffeil i greu IDs is-gwmnïau – bydd arnoch chi angen yr IDs is-gwmnïau yma er mwyn ychwanegu is-gwmnïau at eich sefydliad.

# within_28_days_of_the_change
source: within 28 days of the change. You will need to enter the subsidiary IDs to do this.
cy: o fewn 28 diwrnod ar ôl y newid. Bydd angen ichi roi IDs yr is-gwmnïau er mwyn gwneud hyn.

# search_for_a_subsidiary_by
source: Search for a Subsidiary by name, ID or Companies House number
cy: Chwilio am is-gwmni yn ôl enw, ID neu rif Tŷ'r Cwmnïau

source: Clear and reset
cy: Clirio ac ailosod

source: Search
cy: Chwilio

# subsidiary_not_found_message
source: Make sure you entered the correct subsidiary name, ID or Companies House number. If you need to add a subsidiary to<br />this parent company, use the file upload to create a subsidiary ID and then update and resubmit your registration file.
cy: W Make sure you entered the correct subsidiary name, ID or Companies House number. If you need to add a subsidiary to<br />this parent company, use the file upload to create a subsidiary ID and then update and resubmit your registration file.

# subsidiary_not_found_resubmit_warning_text
source: If you need to add a subsidiary to this parent company, click on add a single subsidiary button below or use the file upload to create a subsidiary ID and then update and resubmit your registration file.
cy: w

source: Before you start
cy: W Before you start

# adding_removing_members_affect_packaging_obligations
source: Adding or removing members might affect your organisation's packaging obligations – make sure you have read the
cy: Gallai ychwanegu neu dynnu aelodau effeithio ar rwymedigaethau pecynwaith eich sefydliad – gofalwch eich bod wedi darllen y

# extended_producer_guidelines
source: guidelines for extended producer responsibility for packaging (opens in a new tab).
cy: canllawiau ynghylch cyfrifoldeb estynedig cynhyrchwyr dros becynwaith (yn agor mewn tab newydd).

source: Upload a file
cy: Uwchlwytho ffeil

# subsidiaries_file_must_be
source: The file must be:
cy: Rhaid i’r ffeil fod:

# subsidiaries_smaller_than_60kb
source: smaller than 60KB
cy: yn llai na 60KB

# subsidiaries_in_csv_format
source: in CSV format
cy: ar fformat CSV

# few_minutes_to_upload_file
source: It may take a few minutes for your file to upload - do not close the window while the file is uploading.
cy: Gallai gymryd ychydig funudau i’ch ffeil uwchlwytho. Peidiwch â chau’r ffenestr tra bo’r ffeil wrthi’n uwchlwytho.

source: Add a single subsidiary
cy: Ychwanegu un is-gwmni

source: Add a single subsidiary to this producer
cy: Ychwanegu un is-gwmni at y cynhyrchydd yma

# subsidiary_not_found_resubmit_with_add_single_subsidiary
source: If you need to add a subsidiary to this parent company, click on add a single subsidiary button below or use the file upload to create a subsidiary ID and then update and resubmit your registration file.
cy: Os oes angen ichi ychwanegu is-gwmni at y rhiant-gwmni yma, cliciwch ar y botwm ychwanegu un is-gwmni neu defnyddiwch uwchlwytho ffeil i greu ID is-gwmni ac wedyn diweddaru ac ailgyflwyno'ch ffeil gofrestru.
