Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/PackagingDataResubmission/FileUploadResubmissionConfirmation.*.resx
Languages: cy

# page_title_producer
source: Confirmation that your packaging data have been updated
cy: [WELSH] Confirmation that your packaging data have been updated

# page_title_compliance
source: Confirmation that Packaging data have been updated
cy: [WELSH] Confirmation that Packaging data have been updated

source: Packaging data updated
cy: [WELSH] Packaging data updated

# submitted_on_z
source: Submitted {0}
cy: Wedi’i gyflwyno {0}

# it_may_take_an_hour
source: It may take up to an hour for our systems to update.
cy: [WELSH] It may take up to an hour for our systems to update.

source: What happens next
cy: Beth sy'n digwydd nesaf

source: You still need to:
cy: [WELSH]You still need to:

# view_your_updated_fee
source: view your updated fees and pay if necessary
cy: [WELSH] view your updated fees and pay if necessary

source: submit to the environmental regulator
cy: Cyflwyno i'r rheoleiddiwr amgylcheddol

source: Continue resubmitting
cy: [WELSH] Continue resubmitting

source: You can
cy: Gallwch chi

# print_or_save_as_PDF
source: print or save this page as a PDF
cy: argraffu'r dudalen hon neu ei chadw fel PDF

source: Give feedback
cy: [WELSH]Give feedback

source: Take an optional survey to help us improve this service.
cy: [WELSH]Take an optional survey to help us improve this service.
