Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/FrontendSchemeRegistration/RegistrationApplicationYearBlock.*.resx
Languages: cy

# registration_for_year
source: Registration for {0}
cy: Cofrestru ar gyfer {0}

# Your_registration_for_x_has_been_granted
source: Your registration for {0} has been granted by the regulator.
cy: Mae eich cofrestriad ar gyfer {0} wedi'i ganiatáu gan y rheoleiddiwr.

# Your_registration_reference_number_is_x
source: Your producer registration number is <strong>{0}</strong>.
cy: Eich rhif cofrestru cynhyrchydd yw <strong>{0}</strong>.

# If_anything_changes_you_should_resubmit
source: Changes to your organisation's data must be reported within 28 days.
cy: Rhaid rhoi gwybod am newidiadau yn nata eich sefydliad o fewn 28 diwrnod

source: Resubmit your data files
cy: Ailgyflwyno'ch ffeiliau data

# The_regulator_has_identified_a_potential_issue
source: The regulator has identified a potential issue with your application and will contact you.
cy: Mae'r rheoleiddiwr wedi nodi problem bosibl gyda'ch cais a bydd yn cysylltu â chi.

source: You will need to submit a corrected registration data file.
cy: Bydd angen ichi gyflwyno ffeil data cofrestru wedi'i chywiro.

# Your_registration_application_for_x_has_been_refused
source: Your registration application for {0} has been refused.
cy: Mae eich cais am gofrestru ar gyfer {0} wedi'i wrthod.

source: Contact the regulator for further advice.
cy: Cysylltwch â'r rheoleiddiwr i gael rhagor o gyngor.

# Your_registration_for_X_has_been_cancelled
source: Your registration for {0} has been cancelled by the regulator.
cy: Mae eich cofrestriad ar gyfer {0} wedi'i ganslo gan y rheoleiddiwr.

source: Contact your regulator if you need advice.
cy: Cysylltwch â'ch rheoleiddiwr os oes arnoch chi angen cyngor.

# You_have_submitted_your_registration_data
source: You have submitted your registration data. It may take up to an hour for our systems to update.
cy: Rydych chi wedi cyflwyno’ch data cofrestru. Gall gymryd hyd at awr i'n systemau gael eu diweddaru.

# You_will_then_need_to_pay_your_registration_fee
source: You will then need to pay your registration fee and submit your registration application.
cy: Wedyn bydd angen ichi dalu’ch ffi gofrestru a chyflwyno'ch cais am gofrestru.

# You_have_submitted_your_registration_data_for_x
source: You have submitted your registration data for {0}.
cy: Rydych chi wedi cyflwyno’ch data cofrestru ar gyfer {0}.

source: View your registration fees and payment methods.
cy: Gweld eich ffioedd cofrestru a'ch dulliau talu.

# You_have_viewed_your_registration_fees
source: You have viewed your registration fees, and methods of payment.
cy: Rydych chi wedi gweld eich ffioedd cofrestru a'ch dulliau talu.

# Payment_must_be_made_before_submitting_your_x
source: Payment must be made before submitting your {0} application.
cy: Rhaid gwneud taliad cyn cyflwyno’ch cais ar gyfer {0}.

# Your_registration_application_for_x_has_been_submitted
source: Your registration application for {0} has been submitted.
cy: Mae eich cais am gofrestru ar gyfer {0} wedi'i gyflwyno.

# You_have_resubmitted_your_registration_data_for_x
source: Your resubmission has been uploaded. It will take up to 1 hour to calculate your fee.
cy: Rydych chi wedi ailgyflwyno'ch data cofrestru ar gyfer {0}.

# View_your_registration_fees_and_payment_methods_resubmission
source: You can then view and pay your fees and complete your â€‹application.
cy: Gweld eich ffioedd cofrestru a'ch dulliau talu.

# You_have_updated_your_data_and_viewed_your_fees
source: You've updated your data and viewed your fees.
cy: Rydych chi wedi diweddaru'ch data ac wedi gweld eich ffioedd.

source: You now need to submit to the regulator.
cy: Nawr mae angen ichi gyflwyno i'r rheoleiddiwr.

# You_have_resubmitted_registration_data
source: You have resubmitted registration data. The environmental regulator is reviewing your data.
cy: Rydych chi wedi ailgyflwyno data cofrestru. Mae’r rheoleiddiwr amgylcheddol wrthi’n adolygu’ch data.

# Your_resubmitted_registration_data_was_rejected
source: Your resubmitted registration data was rejected. Contact the environmental regulator for further advice.
cy: Mae’r data rydych chi wedi’i ailgyflwyno wedi cael ei wrthod. Cysylltwch â’r rheoleiddiwr amgylcheddol i gael rhagor o gyngor.

# Your_resubmitted_data_has_been_accepted
source: Your resubmitted data has been accepted. Report further changes within 28 days of them becoming effective.
cy: Mae’r data rydych chi wedi’i ailgyflwyno wedi cael ei dderbyn. Rhowch wybod am ragor o newidiadau o fewn 28 diwrnod ar ôl iddyn nhw ddod i rym.

# current_small_producer_registration_title
source: Small producer {0} registration
cy: Cofrestru cynhyrchydd bach ar gyfer {0}

# current_large_producer_registration_title
source: Large producer {0} registration
cy: Cofrestru cynhyrchydd mawr ar gyfer {0}

# cso_small_producer_instructions1
source: Small producers must apply for registration on or before {0}.
cy: Rhaid i gynhyrchwyr bach wneud cais i gofrestru ar neu cyn {0}.

# cso_small_producer_instructions2
source: Applications made after this date could incur a late fee.
cy: Gallai ceisiadau a wneir ar ôl y dyddiad hwn arwain at ffi hwyr.

# cso_large_producer_instructions1
source: Large producers needed to apply for registration on or before {0}.
cy: Roedd angen i gynhyrchwyr mawr wneud cais i gofrestru ar neu cyn {0}.

# cso_large_producer_instructions2
source: Applications made after this date could incur a late fee.
cy: Gallai ceisiadau a wneir ar ôl y dyddiad hwn arwain at ffi hwyr.

# direct_large_producer_open_instructions1
source: Large producers must apply for registration for {0} before {1}.
cy: [Welsh]Large producers must register by {0} on {1}.

# direct_large_producer_open_instructions2
source: You can apply after this date, but may incur a late fee.
cy: [Welsh]Small producers can register from {0}. The deadline is {1} on {2}.

# direct_large_producer_late_instructions1
source: The large producer registration deadline for {0} was {1}.
cy: [Welsh]The deadline for large producer registration was {0} on {1}. You can still register, but may incur a late fee.

# direct_large_producer_late_instructions2
source: You can still apply after this date, but may incur a late fee.
cy: [Welsh]Small producers can register from {0}. The deadline is {1} on {2}.

# direct_small_producer_open_instructions1
source: Small producers must apply for registration on or before {0} to avoid a late fee.
cy: [Welsh]Small producers must register by {0} on {1}.

# direct_small_producer_open_instructions2
source: The large producer registration deadline for {0} was {1}.
cy: [Welsh]The deadline for large producer registration was {0} on {1}.

# direct_small_producer_open_instructions3
source: Large producers can still register, but may incur a late fee.
cy: [Welsh]Large producers can still register, but may incur a late fee.

# direct_small_producer_late_instructions1
source: The small producer registration deadline for {0} was {1}.
cy: [Welsh]The deadline for small producer registration was {0} on {1}.

# direct_small_producer_late_instructions2
source: You can still apply after this date, but may incur a late fee.
cy: [Welsh]The deadline for large producer registration was {0} on {1}.
