Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/SubsidiaryCheckDetails/SubsidiaryCheckDetails.*.resx
Languages: cy

# detail_name_header
source: Section
cy: Adran

# detail_value_header
source: Value
cy: Gwerth

# detail_action_header
source: Action
cy: Camau

# check-details
source: Check your answers
cy: Gwiriwch eich atebion

source: Companies House number
cy: Rhif Tŷ'r Cwmnïau

# organisation-details
source: Subsidiary details
cy: Manylion yr is-gwmni

source: UK nation
cy: Y wlad yn y Deyrnas Unedig

# producer-details-heading
source: Producer details
cy: Manylion y cynhyrchydd

source: Producer name
cy: Enw'r cynhyrchydd

# subsidiary-details-heading
source: Subsidiary details
cy: Manylion yr is-gwmni

# declaration_warning
source: You can be fined or prosecuted if you give the wrong information.
cy: Gallwch gael eich dirwyo neu eich erlyn os byddwch chi’n rhoi'r wybodaeth anghywir.

# declaration_statement
source: By confirming your details, you agree that the information you’ve given is complete and correct.
cy: Drwy gadarnhau’ch manylion, rydych chi’n cytuno bod yr wybodaeth rydych chi wedi'i rhoi yn gyflawn ac yn gywir.

source: Declaration
cy: Datganiad

# text_assistive.warning
source: Warning
cy: Rhybudd

# subsidiary-companies-house-number
source: Companies House number
cy: [WELSH] Companies House number
