Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/ReviewCompanyDetails/ReviewCompanyDetails.*.resx
Languages: cy

source: Files you’ve uploaded
cy: Ffeiliau rydych chi wedi’u huwchlwytho

source: File name
cy: Enw’r ffeil

source: Date uploaded
cy: Dyddiad uwchlwytho

source: Uploaded by
cy: Uwchlwythwyd gan

source: Review Compliance Scheme
cy: Adolygu Cynllun Cydymffurfio

source: How to submit your files
cy: Sut i gyflwyno’ch ffeiliau

# get_an_authorised_person_to_submit_the_files
source: Someone in your team with the right account permissions must submit these files to the environmental regulator.
cy: Rhaid i rywun yn eich tîm sydd â’r caniatâd cywir yn y cyfrif gyflwyno’r ffeiliau hyn i’r rheoleiddiwr amgylcheddol.

# get_an_authorised_person_to_submit_the_files_nonregulator
source: Someone in your team with the right account permissions must submit these files.
cy: Rhaid i'r ffeiliau yma gael eu cyflwyno gan rywun yn eich tîm sydd â'r caniatadau cywir ar gyfer y cyfrif.

source: Report packaging data
cy: Rhoi gwybod am ddata pecynwaith

# you_dont_have_permission_to_submit
source: You don’t have permission to submit files.
cy: Does dim caniatâd gennych i gyflwyno ffeiliau.

source: Files uploaded
cy: Ffeiliau sydd wedi’u huwchlwytho

source: Change
cy: Newid

source: Go to your account homepage
cy: Mynd i dudalen hafan eich cyfrif

# submit_your_members_organisation_details
source: Are you sure you want to submit your members’ organisation details?
cy: Ydych chi’n siŵr eich bod am gyflwyno manylion eich sefydliad aelodau?

# yes_submit
source: Yes, I’d like to submit
cy: Hoffwn, fe hoffwn i gyflwyno

# no_not_right_now
source: No, I don’t want to do this right now
cy: Na, dwi ddim eisiau gwneud hynny ar hyn o bryd

# your_org_may_face_enforcement_action_if_the_data_you_submit_is_inaccurate
source: Your organisation may face enforcement action if the data you submit is inaccurate.
cy: Efallai y bydd eich sefydliad yn wynebu camau gorfodi os yw’r data y byddwch chi’n ei gyflwyno yn anghywir.

source: Confirm
cy: Cadarnhau

# information_will_be_sent_to_the_environmental_regulator
source: This information will be sent to the environmental regulator.
cy: Bydd yr wybodaeth hon yn cael ei hanfon at y rheoleiddiwr amgylcheddol.

# submit_your_organisation_details
source: Are you sure you want to submit your organisation details?
cy: Ydych chi’n siŵr eich bod am gyflwyno manylion eich sefydliad?

source: Check files and submit
cy: Gwirio ffeiliau a’u cyflwyno

# ReviewCompanyDetails.ResponseErrorMessage
source: Select yes if you want to submit your members’ organisation details
cy: Dewiswch Hoffwn os hoffech chi gyflwyno manylion eich sefydliad aelodau

source: Files to submit
cy: Ffeiliau i’w cyflwyno

source: Files already submitted
cy: Ffeiliau sydd eisoes wedi’u cyflwyno

# resubmit_your_members_organisation_details
source: Are you sure you want to re-submit your members’ organisation details?
cy: Ydych chi’n siŵr eich bod am ail-gyflwyno manylion eich sefydliad aelodau?

source: Check files and re-submit
cy: Gwirio ffeiliau a’u hailgyflwyno

# yes_resubmit
source: Yes, I’d like to re-submit
cy: Hoffwn, fe hoffwn eu hail-gyflwyno

source: Submitted by
cy: Cyflwynwyd gan

source: Date submitted
cy: Dyddiad cyflwyno

# text_assistive.warning
source: Warning
cy: Rhybudd

# ReviewCompanyDetails.ResponseErrorMessage.Producer
source: Select yes if you want to submit your organisation details
cy: Dewiswch hoffwn os hoffech chi gyflwyno manylion eich sefydliad

# detail_regarding_the_latest_file_uploaded
source: Information about the file you’ve uploaded and can now submit
cy: Gwybodaeth am y ffeil rydych chi wedi’i huwchlwytho ac rydych chi'n cael ei chyflwyno nawr

# detail_regarding_the_latest_file_submitted
source: Information about the last files submitted
cy: Gwybodaeth am y ffeiliau diwethaf a gyflwynwyd

source: Download
cy: lawrlwytho
