Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/RegistrationApplication/ApplicationSubmissionConfirmation.*.resx
Languages: cy

# application_submission_confirm_title
source: Application submission confirmation
cy: Cadarnhad bod cais wedi’i gyflwyno

# registration_application_submitted_for_approval
source: Your registration application for {0} has been submitted for approval
cy: Mae eich cais am gofrestru for {0} wedi'i gyflwyno i'w gymeradwyo

# registration_has_been_granted
source: Your registration for {0} has been granted
cy: Mae eich cofrestriad ar gyfer {0} wedi'i ganiatáu

# application_reference_number
source: Application reference:
cy: Cyfeirnod y cais:

# registration_reference_number
source: Producer registration number:
cy: WProducer registration number:

# submitted_date_x
source: Submitted {0}
cy: Wedi’i gyflwyno {0}

# your_application_submitted_to
source: You have submitted your application to
cy: Rydych chi wedi cyflwyno’ch cais i

# your_application_granted_by
source: Your registration has been granted by
cy: Mae eich cofrestriad wedi'i ganiatáu gan

# england.environmental_regulator
source: the Environment Agency, the environmental regulator for England.
cy: Asiantaeth yr Amgylchedd, rheoleiddiwr amgylcheddol Lloegr.

# scotland.environmental_regulator
source: the Scottish Environment Protection Agency, the environmental regulator for Scotland.
cy: Asiantaeth Diogelu Amgylchedd yr Alban (SEPA), rheoleiddiwr amgylcheddol yr Alban.

# wales.environmental_regulator
source: the Natural Resources Wales (NRW), the environmental regulator for Wales.
cy: Cyfoeth Naturiol Cymru (CNC), rheoleiddiwr amgylcheddol Cymru.

# northernireland.environmental_regulator
source: the Northern Ireland Environment Agency (NIEA), the environmental regulator for NI.
cy: Asiantaeth Amgylchedd Gogledd Iwerddon (NIEA), rheoleiddiwr amgylcheddol Gogledd Iwerddon.

# use_application_reference_in_communication_with_regulator
source: Use your application reference in any communication with the environmental regulator.
cy: Defnyddiwch gyfeirnod eich cais mewn unrhyw gyfathrebiadau â'r rheoleiddiwr amgylcheddol.

# use_registration_reference_number_in_communication_with_regulator
source: Use your producer registration number in any communication with the environmental regulator.
cy: WUse your producer registration number in any communication with the environmental regulator.

source: You can
cy: Gallwch chi

# print_record
source: print
cy: argraffu

# download_record_of_submission_as_PDF
source: download a record of submission as a PDF
cy: lawrlwytho cofnod eich bod chi wedi cyflwyno’r cais fel PDF

# depending_on_your_browser_it_will_open_in_new_window_or_save_to_folder
source: (depending on your browser it will open in a new window or tab, or save to your download folder).
cy: (gan ddibynnu ar eich porwr, bydd yn agor mewn ffenestr neu dab newydd, neu'n cael ei gadw yn eich ffolder lawrlwytho).

source: What happens next
cy: Beth sy’n digwydd nesaf

# you_will_be_contacted_about_your_application_within_12_weeks
source: You'll be notified about the outcome of your application within 12 weeks of submission.
cy: Fe'ch hysbysir am ganlyniad eich cais o fewn 12 wythnos ar ôl ei gyflwyno.

source: Visit your
cy: Ewch i

source: account home page
cy: dudalen hafan eich cyfrif

# check_status_of_your_application
source: to check the status of your application.
cy: i wirio statws eich cais.

source: Your organisation data has been resubmitted
cy: Mae data'ch sefydliad wedi'i ailgyflwyno

source: You will receive an email after the environmental regulator reviews your submission.
cy: Fe gewch chi neges ebost ar ôl i'r rheoleiddiwr amgylcheddol adolygu'ch cyflwyniad.

source: You can only make changes to your organisation data files after they've been reviewed.
cy: Dim ond ar ôl iddyn nhw gael eu hadolygu y cewch chi wneud newidiadau yn eich ffeiliau data pecynwaith.

source: Check the status of your application on
cy: Gwiriwch statws eich cais ar

# you_resubmitted_your_organisation_data_to
source: You've resubmitted your organisation data to
cy: Rydych chi wedi ailgyflwyno data'ch sefydliad i

# you_can_resubmission
source: You can
cy: Gallwch

# print_record_resubmission
source: print
cy: argraffu

# download_record_of_submission_as_PDF_resubmission
source: download a record of submission as a PDF
cy: cyflwyniad lawrlwytho fel PDF

source: (depending on your browser it will open in a new window or tab, or save to your download folder).
cy: (Gan ddibynnu ar eich porwr, bydd yn agor mewn ffesnestr neu dab newydd, neu'n cael ei gadw yn eich ffolder lawrlwythiadau.).
