Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/RegistrationApplication/PaymentOptionPayByBankTransfer.*.resx
Languages: cy

# pay_by_bank_transfer_title
source: Pay by bank transfer
cy: Talu drwy drosglwyddiad banc

# pay_by_bank_transfer_heading
source: Pay by bank transfer
cy: Talu drwy drosglwyddiad banc

# pay_registration_fee_of
source: Pay the registration fee of
cy: Talu’r ffi gofrestru o

source: by bank transfer.
cy: drwy drosglwyddiad banc.

# payment_details_section
source: Payment details
cy: Manylion talu

# england
source: EA (England)
cy: EA (Lloegr)

# wales
source: NRW (Wales)
cy: NRW (Cymru)

# northernireland
source: NIEA (Northern Ireland)
cy: NIEA (Gogledd Iwerddon)

# scotland
source: SEPA (Scotland)
cy: SEPA (Yr Alban)

# use_application_payment_ref
source: Use the application payment reference:
cy: Defnyddiwch y cyfeirnod taliad am gais:

# england.account_name
source: Account name: EA Receipts
cy: Enw'r cyfrif: EA Receipts

# england.account_number
source: Account number: 10014411
cy: Rhif y cyfrif: 10014411

# england.sort_code
source: Sort code: 60-70-80
cy: Cod didoli: 60-70-80

# england.bank_name
source: Bank name: Royal Bank of Scotland, London Corporate Service Centre, CPB Services, 2nd floor, 280 Bishopsgate, London EC2M 4RB
cy: Enw'r banc: Royal Bank of Scotland, London Corporate Service Centre, CPB Services, 2nd floor, 280 Bishopsgate, London EC2M 4RB

# wales.account_name
source: Account name: Natural Resources Wales
cy: Enw'r cyfrif: Natural Resources Wales

# wales.account_number
source: Account number: 10014438
cy: Rhif y cyfrif: 10014438

# wales.sort_code
source: Sort code: 60-70-80
cy: Cod didoli: 60-70-80

# wales.bank_name
source: Bank name: National Westminster Bank PLC, 2 Â½ Devonshire Square, London EC2M 4BA
cy: Enw'r banc: National Westminster Bank PLC, 2 ½ Devonshire Square, London EC2M 4BA

# northernireland.account_name
source: Account name: DAERA General Account
cy: Enw'r cyfrif: DAERA General Account

# northernireland.account_number
source: Account number: 61253506
cy: Rhif y cyfrif: 61253506

# northernireland.sort_code
source: Sort code: 95-01-21
cy: Cod didoli: 95-01-21

# northernireland.bank_name
source: Bank name: Danske Bank, PO BOX 183, Donegall Square West, Belfast, BT1 6JS
cy: Enw'r banc: Danske Bank, PO BOX 183, Donegall Square West, Belfast, BT1 6JS

# scotland.account_name
source: Account name: Scottish Environment Protection Agency
cy: Enw'r cyfrif: Scottish Environment Protection Agency

# scotland.account_number
source: Account number: 00137187
cy: Rhif y cyfrif: 00137187

# scotland.sort_code
source: Sort code: 83-34-00
cy: Cod didoli: 83-34-00

# scotland.bank_name
source: Bank name: Royal Bank of Scotland, 30 Nicholson Street, Edinburgh, EH8 9DL
cy: Enw'r banc: Royal Bank of Scotland, 30 Nicholson Street, Edinburgh, EH8 9DL

# scotland_online_payment_link
source: Online payments | Beta | SEPA | Scottish Environment Protection Agency
cy: Taliadau ar-lein | Beta | SEPA | Asiantaeth Diogelu Amgylchedd yr Alban

# northernireland.cheques_payable_to_DAERA_General_Account
source: NIEA also accepts cheques.Cheques should be payable to DAERA General Account, and sent to:
cy: Mae NIEA yn derbyn sieciau hefyd. Dylai sieciau fod yn daladwy i Gyfrif Cyffredinol DAERA, a chael eu hanfon i:

source: You can also
cy: Rydych chi hefyd yn gallu

source: pay SEPA direct
cy: talu SEPA yn uniongyrchol

source: Northern Ireland Environment Agency
cy: Asiantaeth Amgylchedd Gogledd Iwerddon

# northernireland.application_reference_on_back_of_cheque
source: Write your application reference ({0}) on the back of the cheque.
cy: Ysgrifennwch gyfeirnod eich cais ({0}) ar gefn y siec.

source: After payment is made
cy: Ar ôl i’r taliad gael ei wneud

source: After you've paid
cy: Ar ôl ichi dalu

# submit_application_from_registration_dashboard
source: 1. Submit your application from the registration dashboard.
cy: 1. Cyflwynwch eich cais o'r dangosfwrdd cofrestru pan fydd y taliad wedi'i wneud.

# northernireland.send_remittance_advice_to
source: 2. If you have paid by bank transfer, send remittance advice to
cy: 2. Os ydych wedi talu drwy drosglwyddiad banc, anfonwch hysbysiad talu at

# england.for_BACS_remittance_send_details
source: 1. Send BACS remittance to
cy: 1. Anfonwch hysbysiad y taliad BACS i

source: You can
cy: Gallwch chi

# and_space
source: and
cy: a

# print_or_save_as_PDF
source: print or save this page as a PDF
cy: argraffu’r tudalen yma neu ei gadw fel PDF

# return_to_dashboard
source: Return to the dashboard
cy: Yn ôl i’r dangosfwrdd

# submit_your_application_from_registration_dashboard
source: Submit your application from the registration dashboard
cy: Cyflwynwch eich cais o'r dangosfwrdd cofrestru.

source: Continue
cy: Parhau

source: Continue registration application
cy: Parhau â'r cais am gofrestru

source: Send BACS_remittance to
cy: Anfon hysbysiad talu BACS at
