Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/RegistrationApplication/PaymentOptionPayByPhone.*.resx
Languages: cy

# pay_by_phone_title
source: Pay by phone
cy: Talu dros y ffôn

# pay_by_phone_heading
source: Pay by phone
cy: Talu dros y ffôn

# pay_registration_fee_of
source: Pay the registration fee of
cy: Talu’r ffi gofrestru o

source: by phone.
cy: dros y ffôn.

# have_bank_details_ready
source: Have your bank details ready to call.
cy: Byddwch yn barod â’ch manylion banc er mwyn ffonio.

# payment_details_section
source: Payment details
cy: Manylion talu

# enquires_subsection
source: Enquires
cy: Ymholiadau

source: England
cy: Lloegr

# use_application_payment_ref
source: Use the application payment reference:
cy: Defnyddiwch y cyfeirnod taliad am gais:

source: Environment Agency
cy: Asiantaeth yr Amgylchedd

# telephone_within_UK
source: Telephone: 03708 506 506
cy: Ffôn: 03708 506 506

# telephone_from_abroad
source: Telephone from outside the UK: +44 (0) 114 282 5312
cy: Ffôn o'r tu allan i'r Deyrnas Unedig: +44 (0) 114 282 5312

# working_hours
source: Monday to Friday, 8am to 6pm
cy: Dydd Llun i ddydd Gwener, 8am i 6pm

# more_about_call_charges
source: Find out about call charges
cy: Gwybodaeth am daliadau am alwadau

source: You can
cy: Gallwch chi

# print_or_save_as_PDF
source: print or save this page as a PDF
cy: argraffu’r tudalen yma neu ei gadw fel PDF

# return_to_dashboard
source: Return to the dashboard
cy: Yn ôl i’r dangosfwrdd

# continue_registration
source: Once you've paid the registration fee, you can continue your registration application.
cy: Ar ôl i chi dalu'r ffi gofrestru, gallwch barhau â'ch cais cofrestru.
