Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/RegistrationApplication/ProducerRegistrationGuidance.*.resx
Languages: cy

# producer_registration_guidance_title
source: Producer Registration Guidance
cy: Canllawiau i Gynhyrchwyr ar Gofrestru

# register_company
source: {0} registration
cy: {0} cofrestru

source: Scheme registration details
cy: Manylion cofrestru'r cynllun

# organisation_id_x
source: Organisation ID: {0}
cy: ID y sefydliad: {0}

# compliance_scheme_x
source: Compliance scheme: {0}
cy: Cynllun cydymffurfio: {0}

source: Regulator:
cy: Rheoleiddiwr:

# england.environmental_regulator
source: Environment Agency (England)
cy: Asiantaeth yr Amgylchedd (EA)

# scotland.environmental_regulator
source: Scottish Environment Protection Agency (Scotland)
cy: Asiantaeth Diogelu Amgylchedd yr Alban (SEPA)

# wales.environmental_regulator
source: Natural Resources Wales (NRW) (Wales)
cy: Cyfoeth Naturiol Cymru (CNC)

# northernireland.environmental_regulator
source: Office for Environmental Protection (OEP) (Northern Ireland)
cy: Asiantaeth Amgylchedd Gogledd Iwerddon (NIEA)

# if_you_are_obligated_under_PRO_2024_you_must_register
source: If you are obligated under the Producer Responsibility Obligations (Packaging and Packaging Waste) Regulations 2024, you must register.
cy: Os ydych chi o dan rwymedigaeth o dan Reoliadau Rhwymedigaethau Cyfrifoldeb Cynhyrchwyr (Pecynwaith a Gwastraff Pecynwaith) 2024, rhaid ichi gofrestru.

source: To apply for registration you must:
cy: I wneud cais am gofrestru mae'n rhaid ichi:

# upload_your_organisation_data
source: upload your organisation's details.
cy: uwchlwytho manylion eich sefydliad

source: make payment.
cy: gwneud taliad.

source: submit your application.
cy: cyflwyno’ch cais.

# you_must_be_approved_or_delegated_person_to_submit_data_complete_registration
source: You must be an approved or delegated person to submit your data and complete the application.
cy: Rhaid i chi fod yn berson wedi’i gymeradwyo neu wedi’i ddirprwyo er mwyn cyflwyno'ch data a chwblhau'r cais.

# more_about_packaging_responsibilities_and_check_need_for_action
source: Find out more about packaging responsibilities and check if you need to take action (opens in a new tab)
cy: Rhagor o wybodaeth am gyfrifoldebau pecynwaith a gwirio a oes angen ichi weithredu (yn agor mewn tab newydd)

# ensure_your_packaging_data_for_year_been_reported_before_registering
source: Ensure your packaging data for {0} has been reported before registering. Failure may result in delays to your registration being assessed.
cy: To avoid registration delays, report your {0} packaging data before applying to register for {1}.
