Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/RegistrationApplication/RegistrationTaskList.*.resx
Languages: cy

# registration_task_title
source: Continue your registration
cy: Parhau â'ch cofrestriad

# registration_resubmission_task_title
source: Continue your resubmission
cy: Parhau â'ch cofrestriad

# register_company
source: {0} registration
cy: {0} cofrestru

# register_resubmission_company
source: {0} data resubmission
cy: Cyflwyniad data {0}

source: Submit registration data
cy: Cyflwyno data cofrestru

source: Update registration details
cy: Diweddaru manylion cofrestru

# you_have_submitted_organisation_brand_partner_details
source: You have submitted organisation, brand and partner details
cy: Rydych chi wedi cyflwyno manylion sefydliad, brand a phartneriaid

# you_have_resubmitted_organisation_brand_partner_details
source: You have resubmitted organisation, brand and partner details
cy: Rydych chi wedi cyflwyno manylion sefydliad, brand a phartneriaid

# view_pay_registration_fee
source: View registration fee
cy: Gweld y ffi gofrestru

# you_have_paid_registration_fee
source: You have viewed the registration fee and selected a payment method
cy: Rydych chi wedi gweld y ffi gofrestru ac wedi dewis dull talu

# view_pay_fee_if_required
source: View and pay fees if required
cy: Gweld y ffi gofrestru

# you_have_paid_resubmission_fee
source: You have viewed the registration fee and selected a payment method
cy: Rydych chi wedi gweld y ffi gofrestru ac wedi dewis dull talu

source: Submit registration application
cy: cyflwyno’ch cais

source: Submit amended data
cy: Cyflwyno data diwygiedig

# can_not_start_yet_status
source: CANNOT START YET
cy: METHU DECHRAU ETO

# not_started_status
source: NOT STARTED
cy: HEB DDECHRAU

# pending_status
source: PENDING
cy: YN YR ARFAETH

# completed_status
source: COMPLETED
cy: WEDI’I GWBLHAU

# return_to_dashboard
source: Return to the dashboard
cy: Dychwelyd i'r dangosfwrdd

# registration_application_has_been_submitted
source: Your application has been submitted
cy: Mae eich cais am gofrestru wedi'i gyflwyno

# registration_resubmission_application_has_been_submitted
source: Your application has been submitted
cy: Mae eich cais am gofrestru wedi'i gyflwyno

# register_company_size_small
source: Small producer {0} registration
cy: Cofrestru cynhyrchydd bach ar gyfer {0}
