Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/FileUploadPartnershipsSuccess/FileUploadPartnershipsSuccess.*.resx
Languages: cy

# file_uploaded
source: Partner information uploaded
cy: Gwybodaeth am bartneriaid wedi’i huwchlwytho

# go_to_review
source: Continue
cy: Parhau

# page_title
source: Upload Partner Information Completed
cy: Wedi gorffen uwchlwytho gwybodaeth am bartneriaid

source: Success
cy: Llwyddiant

source: What happens next
cy: Beth sy’n digwydd nesaf

# youve_uploaded_all
source: You’ve uploaded all the organisation details.
cy: Rydych chi wedi uwchlwytho holl fanylion y sefydliad.

# you_can_now
source: You can now see a list of the files you’ve uploaded, and change them if you need to.
cy: Nawr gallwch weld rhestr o’r ffeiliau rydych chi wedi’u huwchlwytho, a’u newid os oes angen ichi wneud hynny.

source: If you think this is incorrect
cy: Os ydych chi'n meddwl bod hyn yn anghywir

# re_upload_your_organisation_details
source: you can upload again.
cy: gallwch chi uwchlwytho eto.

# return_to_dashboard
source: Return to the dashboard
cy: Yn ôl i’r dangosfwrdd

source: Partner details uploaded
cy: Manylion partner wedi'u llwytho i fyny

# view_or_correct_uploaded_file_select_continue
source: To view or correct your uploaded files, select 'continue'.
cy: I weld neu gywiro'ch ffeiliau a uwchlwythwyd, dewiswch 'parhau'.
