Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/CompanyDetailsConfirmation/CompanyDetailsConfirmation.*.resx
Languages: cy

source: What happens next
cy: Beth sy’n digwydd nesaf

# what_to_do
source: What to do about changes
cy: Beth i’w wneud am newidiadau

# go_to_your_home
source: Go to your account homepage
cy: Mynd i dudalen hafan eich cyfrif

# submitted_by
source: Submitted by {0} at {1} on {2}.
cy: Cyflwynwyd gan {0} am {1} ar {2}.

# the_environmental_regulator_producer
source: The environmental regulator will review your organisation details. They’ll contact your organisation by email or telephone if there are any problems.
cy: Bydd y rheoleiddiwr amgylcheddol yn adolygu manylion eich sefydliad. Byddan nhw’n cysylltu â’ch sefydliad drwy’r ebost neu dros y ffôn os oes unrhyw broblemau.

# the_environmental_regulator_compliance
source: The environmental regulator will review your members’ organisation details. They’ll contact your organisation by email or telephone if there are any problems.
cy: Bydd y rheoleiddiwr amgylcheddol yn adolygu manylion eich sefydliad aelodau. Byddan nhw’n cysylltu â’ch sefydliad drwy’r ebost neu dros y ffôn os oes unrhyw broblemau.

# if_there_are_changes_producer
source: If there are any changes to your organisation details, you must report them within 28 days of them happening. You can do this by re-submitting your CSV files.
cy: Os oes unrhyw newidiadau ym manylion eich sefydliad, rhaid i chi roi gwybod amdanyn nhw o fewn 28 diwrnod ar ôl iddyn nhw ddigwydd. Gallwch wneud hyn drwy ail-gyflwyno’ch ffeiliau CSV.

# if_there_are_changes_compliance
source: If there are any changes to your members’ organisation details, you must report them within 28 days of them happening. You can do this by re-submitting your CSV files.
cy: Os oes unrhyw newidiadau ym manylion eich sefydliad aelodau, rhaid i chi roi gwybod amdanyn nhw o fewn 28 diwrnod ar ôl iddyn nhw ddigwydd. Gallwch wneud hyn drwy ail-gyflwyno’ch ffeiliau CSV.

# organisation_details_submitted
source: Organisation details submitted to the environmental regulator
cy: Manylion y sefydliad wedi’u cyflwyno i’r rheoleiddiwr amgylcheddol

# organisation_details_submitted_registration
source: Organisation details submitted
cy: Manylion y sefydliad wedi'u cyflwyno

source: You still need to:
cy: Mae'n dal yn angenrheidiol ichi:

source: pay your registration fee
cy: talu'ch ffi gofrestru

source: apply for registration
cy: gwneud cais am gofrestru

source: Return to registration
cy: Yn ôl i gofrestru

# page_title_producer
source: Confirmation that your organisation details have been submitted
cy: Cadarnhad bod manylion eich sefydliad wedi’u cyflwyno

# page_title_compliance
source: Confirmation that organisation details have been submitted
cy: Cadarnhad bod manylion y sefydliad wedi’u cyflwyno

source: Print this page
cy: Argraffu’r tudalen yma

# you_can_save_this_page
source: You can save this page using the ‘print’ option in your browser.
cy: Gallwch gadw’r tudalen yma drwy ddefnyddio’r opsiwn ’print’ yn eich porwr.
