Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/ComplianceSchemeLanding/ComplianceSchemeLanding.*.resx
Languages: cy

# title
source: Home
cy: Hafan

# account_home
source: Account home - {0}
cy: Hafan y cyfrif - {0}

# report_packaging_data
source: Report your members’ packaging data
cy: Rhoi gwybod am ddata pecynwaith eich aelodau

# report_organisation_details
source: Report your members’ organisation details
cy: Rhoi gwybod am fanylion eich sefydliad aelodau

source: Members’ organisation details
cy: Manylion y sefydliad aelodau

# you_must_report_org_data
source: You must report organisation details for January to June and July to December.
cy: Rhaid ichi roi gwybod am fanylion eich sefydliad ar gyfer Ionawr i Fehefin a Gorffennaf i Ragfyr:

source: You can also:
cy: Rydych chi hefyd yn cael:

# report_changes_to_your_organisation_details
source: report changes to your members’ organisation details
cy: rhoi gwybod am newidiadau ym manylion eich sefydliad aelodau

# resubmit_your_organisation_details
source: resubmit your members’ organisation details
cy: ailgyflwyno manylion eich sefydliad aelodau

source: view your history
cy: gweld eich hanes

source: Members’ packaging data
cy: Data pecynwaith yr aelodau

# you_must_report_packaging_data
source: You must report packaging data for 2024. Report this data by 1 April, 2025.
cy: Angen ichi roi gwybod am ddata pecynwaith ar gyfer {0}. Roi gwybod am ddata hwn erbyn 1 {1} {2}.

# resubmit_your_packaging_data
source: resubmit your members’ packaging data
cy: ailgyflwyno data pecynwaith eich aelodau

# packaging_recovery_notes
source: Packaging waste recycling note (PRN) and packaging waste export recycling note (PERN)
cy: Nodyn ailgylchu gwastraff pecynwaith (PRN) a nodyn ailgylchu allforio pecynwaith gwastraff (PERN)

# no_action_needed
source: No action needed at the moment
cy: Dim angen gweithredu ar hyn o bryd

source: Important
cy: Pwysig

source: View invitation
cy: Gweld y gwahoddiad

# youve-been-invited
source: You’ve been invited to change your account permission, so you can submit data to the environmental regulator.
cy: Rydych chi wedi cael gwahoddiad i newid caniatâd eich cyfrif, er mwyn ichi gyflwyno data i’r rheoleiddiwr amgylcheddol.

# waiting-for-approval
source: Waiting for approval to submit data
cy: Wrthi’n aros am gymeradwyaeth i gyflwyno data

# well-email-you
source: We’ll email you when the environmental regulator has given you permission to submit data.
cy: Byddwn yn anfon neges ebost atoch pan fydd y rheoleiddiwr amgylcheddol wedi rhoi caniatâd ichi gyflwyno data.

# summary-data-for
source: Data for
cy: Data ar gyfer

# summary-your-account-is-linked-to
source: Your account is linked to
cy: Mae eich cyfrif yn gysylltiedig â

# summary-members
source: members
cy: o aelodau

# summary-view-members
source: View members
cy: Gweld aelodau

# summary-view-and-remove-members
source: View and remove members
cy: Gweld a thynnu aelodau

# summary-members-info
source: When a member selects your compliance scheme in their ‘report packaging data’ account we’ll link them to your account.
cy: Pan fydd aelod yn dewis eich cynllun cydymffurfio yn ei gyfrif ‘rhoi gwybod am ddata pecynwaith’, byddwn yn eu cysylltu â’ch cyfrif.

# summary-last-updated
source: Last updated
cy: Y diweddariad diwethaf

# summary-regulator-england
source: the Environment Agency
cy: Asiantaeth yr Amgylchedd

# summary-regulator-northern-ireland
source: the Northern Ireland Environment Agency
cy: Asiantaeth Amgylchedd Gogledd Iwerddon

# summary-regulator-scotland
source: the Scottish Environment Protection Agency
cy: Asiantaeth Diogelu Amgylchedd yr Alban

# summary-regulator-wales
source: Natural Resources Wales
cy: Cyfoeth Naturiol Cymru

# summary-regulator
source: the regulator
cy: y rheoleiddiwr

# date1_to_date2
source: {0} to {1}
cy: {0} i {1}

# summary-member
source: member
cy: o aelodau

source: Home
cy: Hafan

source: Subsidiaries
cy: Is-gwmni

# add-manage-subsidiaries
source: Add and manage your subsidiary companies.
cy: Ychwanegu un is-gwmni

# prn_heading_text
source: Manage your {0} recycling obligations
cy: Rheoli'ch rhwymedigaethau ailgylchu ar gyfer {0}

# prn_paragraph_1
source: Review your recycling obligations calculations and accept PRNs or PERNs to meet them. You can also:
cy: Adolygu'ch cyfrifiadau ar gyfer eich rhwymedigaethau ailgylchu a derbyn PRNs neu PERNs i fodloni'r rhain. Rydych chi hefyd yn gallu:

# prn_unordered_list_point_1
source: view recycling obligations by material
cy: gweld rhwymedigaethau ailgylchu fesul deunydd

# prn_unordered_list_point_2
source: check your recycling obligations progress
cy: gwirio cynnydd eich rhwymedigaethau ailgylchu

source: Registration
cy: Cofrestriad

# you_need_to_register_by_31_April
source: You need to register by 31 April for the current year
cy: Mae angen i chi gofrestru erbyn 31 Ebrill ar gyfer y flwyddyn gyfredol

# You_have_submitted_your_registration_data
source: You have submitted your registration data. It may take up to an hour for our systems to update.
cy: Rydych chi wedi cyflwyno’ch data cofrestru. Gall gymryd hyd at awr i'n systemau gael eu diweddaru.

# You_will_then_need_to_pay_your_registration_fee
source: You will then need to pay your registration fee and submit your registration application.
cy: Wedyn bydd angen ichi dalu’ch ffi gofrestru a chyflwyno'ch cais am gofrestru.

# You_have_submitted_your_registration_data_for_x
source: You have submitted your registration data for {0}.
cy: Rydych chi wedi cyflwyno’ch data cofrestru ar gyfer {0}.

source: View your registration fees and payment methods.
cy: Gweld eich ffioedd cofrestru a'ch dulliau talu.

# You_have_viewed_your_registration_fees
source: You have viewed your registration fees, and methods of payment.
cy: Rydych chi wedi gweld eich ffioedd cofrestru a'ch dulliau talu.

# Payment_must_be_made_before_submitting_your_x
source: Payment must be made before submitting your {0} application.
cy: Rhaid gwneud taliad cyn cyflwyno’ch cais ar gyfer {0}.

# Your_registration_application_for_x_has_been_submitted
source: Your registration application for {0} has been submitted.
cy: Mae eich cais am gofrestru ar gyfer {0} wedi'i gyflwyno.

# Your_registration_for_x_has_been_granted
source: Your registration for {0} has been granted by the regulator.
cy: Mae eich cofrestriad ar gyfer {0} wedi'i ganiatáu gan y rheoleiddiwr.

# Your_registration_reference_number_is_x
source: Your producer registration number is <strong>{0}</strong>.
cy: Eich rhif cofrestru cynhyrchydd yw <strong>{0}</strong>.

# If_anything_changes_you_should_resubmit
source: Changes to your organisation's data must be reported within 28 days.
cy: Os bydd unrhyw beth yn newid, dylech ailgyflwyno’ch data.

# The_regulator_has_identified_a_potential_issue
source: The regulator has identified a potential issue with your application and will contact you.
cy: Mae'r rheoleiddiwr wedi nodi problem bosibl gyda'ch cais a bydd yn cysylltu â chi.

source: You will need to submit a corrected registration data file.
cy: Bydd angen ichi gyflwyno ffeil data cofrestru wedi'i chywiro.

# Your_registration_application_for_x_has_been_refused
source: Your registration application for {0} has been refused.
cy: Mae eich cais am gofrestru ar gyfer {0} wedi'i wrthod.

source: Contact the regulator for further advice.
cy: Cysylltwch â'r rheoleiddiwr i gael rhagor o gyngor.

# Your_registration_for_X_has_been_cancelled
source: Your registration for {0} has been cancelled by the regulator.
cy: Mae eich cofrestriad ar gyfer {0} wedi'i ganslo gan y rheoleiddiwr.

source: Contact your regulator if you need advice.
cy: Cysylltwch â'ch rheoleiddiwr os oes arnoch chi angen cyngor.

# you_need_to_register_by_1_April
source: You must register your organisation for {0}.
cy: Rhaid i chi gofrestru eich sefydliad ar gyfer {0}.

# Apply_by_1st_April_x
source: Apply by 1st April, {0}
cy: Gwnewch gais erbyn 1 Ebrill, {0}

source: Resubmit your data files
cy: Ailgyflwyno'ch ffeiliau data

# You_have_resubmitted_your_registration_data_for_x
source: You have resubmitted your registration data for {0}.
cy: Rydych chi wedi ailgyflwyno'ch data cofrestru ar gyfer {0}.

# You_have_updated_your_data_and_viewed_your_fees
source: You've updated your data and viewed your fees.
cy: Rydych chi wedi diweddaru'ch data ac wedi gweld eich ffioedd.

source: You now need to submit to the regulator.
cy: Nawr mae angen ichi gyflwyno i'r rheoleiddiwr.
