Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/PrnsObligation/ObligationsHome.*.resx
Languages: cy

source: EPR for packaging data homepage
cy: EPR ar gyfer deunydd pacio hafan data

source: Home
cy: Cartref

source: How to meet the glass recycling obligation
cy: Sut i gyflawni'r rhwymedigaeth ailgylchu gwydr

# how_to_meet_the_glass_recycling_obligation_description
source: A minimum of {0}% of your glass recycling obligation must be made up of glass re-melt PRNs or PERNs. This will make up a proportion of your overall glass recycling obligation. The remaining glass recycling obligation can be met by either glass re-melt, glass other or a mix of both.
cy: Rhaid i {0}% o leiaf o'ch rhwymedigaeth ailgylchu gwydr fod yn PRNs neu PERNs gwydr aildoddi. Bydd hyn yn ffurfio cyfran o gyfanswm eich rhwymedigaeth ailgylchu gwydr. Gall gweddill y rhwymedigaeth ailgylchu gwydr gael ei gyflawni ar ffurf gwydr aildoddi, gwydr arall neu gymysgedd o'r ddau.

source: How to meet your recycling obligations
cy: Sut i gyflawni'ch rhwymedigaethau ailgylchu

# manage_your_recycling_obligations
source: Manage your {0} recycling obligations
cy: Rheoli'ch rhwymedigaethau ailgylchu ar gyfer {0}

source: the regulator accepts your data submissions
cy: ar ôl i'r rheoleiddiwr dderbyn eich cyflwyniadau data

# your_recycling_obligations_will_be
source: Your recycling obligations will be calculated after:
cy: Bydd eich rhwymedigaethau ailgylchu yn cael eu cyfrifo:

# you_can_start_acquiring_and_accepting
source: You can start acquiring and accepting PRNs and PERNs to meet your recycling obligations.
cy: Gallwch chi ddechrau sicrhau a derbyn PRNs a PERNs i gyflawni'ch rhwymedigaethau ailgylchu.

# you_submit_your_packaging_data_for
source: you submit your packaging data for {0}
cy: ar ôl ichi gyflwyno'ch data pecynwaith ar gyfer {0}

source: to meet your recycling obligations for
cy: i gyflawni'ch rhwymedigaethau ailgylchu ar gyfer

source: You have until
cy: Mae gennych chi tan

# enforcement_action_warning
source: You may face enforcement action if you miss this deadline.
cy: Os collwch chi'r dyddiad cau yma, fe allech chi wynebu camau gorfodi. Nifer y PRNs a'r PERNs sy'n aros i gael eu derbyn

# january
source: 31 January
cy: 31 Ionawr

# acquire_and_accept_advisory_text
source: Acquire and accept PRNs and PERNs until your recycling obligations are fully met. Select a material for information on how the data was calculated and view your progress towards meeting your {0} recycling obligations.
cy: Ewch ati i sicrhau a derbyn PRNs a PERNs nes bod eich rhwymedigaethau ailgylchu wedi'u cyflawni'n llwyr. Dewiswch ddeunydd ar gyfer gwybodaeth am sut cafodd y data ei gasglu ac i weld eich cynnydd tuag at gyflawni'ch rhwymedigaethau ailgylchu ar gyfer {0}.
