Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/Shared/Partials/Prns/_calculationsGlass.*.resx
Languages: cy

source: How we calculated your recycling obligation
cy: Sut cafodd eich rhwymedigaeth ailgylchu ei gyfrifo

source: Total glass obligation
cy: Cyfanswm y rhwymedigaeth gwydr

source: We applied this formula to calculate your total glass obligation
cy: Fe ddefnyddion ni'r fformwla yma i gyfrifo cyfanswm eich rhwymedigaeth gwydr

# is_n_tonnes_the_total_glass_you_reported_to_the_nearest_tonne
source: is {0} tonnes (the total glass material you reported for 2024 to the nearest tonne)
cy: yw {0} o dunelli (cyfanswm y gwydr y rhoesoch chi wybod amdano ar gyfer 2024, i'r dunnell agosaf)

# is_n_percent_recycling_target_for_glass_set_by_the_yyyy_regulations
source: is {0}% (recycling target for glass set by the {1} regulations)
cy: yw {0} (y targed ailgylchu ar gyfer {1} ar gyfer gwydr)

source: Your remaining glass obligation is
cy: Cyfanswm eich rhwymedigaeth ailgylchu gwydr yw

source: tonnes
cy: o dunelli

source: Glass re-melt obligation
cy: Rhwymedigaeth gwydr aildoddi

# your_glass_remelt_obligation_is_part_of_your_total_yyyy_glass_obligation
source: Your glass re-melt obligation is part of your total glass obligation. It is always rounded up to the nearest tonne. We used the formula set out in the {0} regulations to calculate it
cy: Mae'ch rhwymedigaeth gwydr aildoddi yn rhan o gyfanswm eich rhwymedigaeth gwydr. Mae bob amser yn cael ei dalgrynnu i fyny i'r dunnell agosaf. Fe ddefnyddion ni'r fformwla sydd wedi'i nodi yn rheoliadau {0} i'w chyfrif

# is_n_percent_the_percentage_recycling_target_for_glass_remelt
source: is {0}% (recycling target for glass re-melt set by the 2024 regulations)
cy: yw (0)% (y targed ailgylchu ar gyfer gwydr aildoddi a osodwyd gan reoliadau 2024)

source: Your glass re-melt obligation
cy: Eich rhwymedigaeth gwydr aildoddi

source: is
cy: yw

source: Remaining glass obligation
cy: Rhwymedigaeth gweddill y gwydr

# to_determine_your_remaining_glass_obligation
source: To determine your remaining glass obligation, we subtract the glass re-melt obligation from your total obligation.
cy: I bennu'ch rhwymedigaeth ar gyfer gweddill y gwydr, rydyn ni'n tynnu'r rhwymedigaeth gwydr aildoddi o gyfanswm eich rhwymedigaeth.

source: Your total glass recycling obligation (Z) is
cy: Cyfanswm eich rhwymedigaeth ailgylchu gwydr (Z) yw
