Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/Shared/Partials/Prns/_prnMaterialTable.*.resx
Languages: cy

# arialabel_aluminium
source: Aluminium recycling obligation page
cy: Tudalen rhwymedigaethau ailgylchu alwminiwm

source: Aluminium
cy: Alwminiwm

# arialabel_glass
source: Glass recycling obligation page
cy: Tudalen rhwymedigaethau ailgylchu gwydr

source: Glass
cy: Gwydr

source: Glass recycling obligation breakdown
cy: Dadansoddiad o'r rhwymedigaeth ailgylchu gwydr

# arialabel_glass_remelt
source: Glass re-melt recycling obligation page
cy: Tudalen rhwymedigaethau ailgylchu gwydr aildoddi

source: Glass re-melt
cy: Gwydr aildoddi

source: Material
cy: Deunydd

source: MET
cy: Wedi'i gyflawni

source: Not available yet
cy: Heb fod ar gael eto

source: NOT MET
cy: Heb ei gyflawni

source: NO DATA YET
cy: Dim data eto

# arialabel_paper_board_fibre
source: Paper, board or fibre-based composite material recycling obligation page
cy: Tudalen rhwymedigaethau ailgylchu papur, bwrdd neu ddeunydd cyfansawdd sy'n seiliedig ar ffeibrau

# paper_board_fibre
source: Paper, board or fibre-based composite material
cy: Papur, bwrdd neu ddeunydd cyfansawdd sy'n seiliedig ar ffeibrau

# arialabel_plastic
source: Plastic recycling obligation page
cy: Tudalen rhwymedigaethau ailgylchu plastigau

source: Plastic
cy: Plastig

source: Recycling obligations to meet
cy: Rhwymedigaethau ailgylchu i'w cyflawni

# arialabel_remaining_glass
source: Remaining glass recycling obligation page
cy: Tudalen rhwymedigaethau ailgylchu gweddill y gwydr

source: Remaining glass
cy: Gweddill y gwydr

source: Status
cy: Statws

# arialabel_steel
source: Steel recycling obligation page
cy: Tudalen rhwymedigaethau ailgylchu dur

source: Steel
cy: Dur

source: Tonnage accepted
cy: Tunelli wedi'u derbyn

source: Tonnage awaiting acceptance
cy: Tunelli yn aros i gael eu derbyn

source: Tonnage outstanding
cy: Tunelli sy'n weddill

source: Totals
cy: Cyfansymiau

# arialabel_wood
source: Wood recycling obligation page
cy: Tudalen rhwymedigaethau ailgylchu pren

source: Wood
cy: Pren

source: Your recycling obligations progress
cy: Cynnydd eich rhwymedigaethau ailgylchu
