Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/Shared/Partials/Prns/_recyclingNoteStatus.*.resx
Languages: cy

source: Accreditation number
cy: Rhif achredu

source: Authorised by
cy: Wedi'i awdurdodi gan

source: Issued by
cy: Wedi'i roi gan

source: Packaging producer or compliance scheme
cy: Cynhyrchydd y pecynwaith neu'r cynllun cydymffurfio

source: Reproccessing site
cy: Safle ailbrosesu

source: Status
cy: Statws

source: Status meaning
cy: Ystyr y statws

# prn_awaiting_acceptance_explanation
source: The reprocessor issued the PRN to the producer or compliance scheme. The producer or compliance scheme has not yet accepted the PRN.
cy: Cafodd y PRN ei roi gan yr ailbrosesydd i'r cynhyrchydd neu'r cynllun cydymffurfio. Mae'r cynhyrchydd neu'r cynllun cydymffurfio heb dderbyn y PERN eto.

# prn_accepted_explanation
source: The producer or compliance scheme accepted the PRN.
cy: Cafodd y PRN ei dderbyn gan y cynhyrchydd neu'r cynllun cydymffurfio.

# prn_rejected_explanation
source: The producer or compliance scheme rejected the PRN.
cy: Cafodd y PRN ei wrthod gan y cynhyrchydd neu'r cynllun cydymffurfio.

# prn_cancelled_explanation
source: The regulator cancelled the PRN.
cy: PRN Wedi'i ganslo

# pern_awaiting_acceptance_explanation
source: The exporter issued the PERN to the producer or compliance scheme. The producer or compliance scheme has not yet accepted the PERN.
cy: Cafodd y PERN ei roi gan yr allforiwr i'r cynhyrchydd neu'r cynllun cydymffurfio. Mae'r cynhyrchydd neu'r cynllun cydymffurfio heb dderbyn y PERN eto.

# pern_accepted_explanation
source: The producer or compliance scheme accepted the PERN.
cy: Cafodd y PERN ei dderbyn gan y cynhyrchydd neu'r cynllun cydymffurfio.

# pern_rejected_explanation
source: The producer or compliance scheme rejected the PERN.
cy: Cafodd y PERN ei wrthod gan y cynhyrchydd neu'r cynllun cydymffurfio.

# pern_cancelled_explanation
source: The regulator cancelled the PERN.
cy: PERN Wedi'i ganslo

# missing_status_explanation
source: Status not found.
cy: Statws heb ei ganfod

# view_prns_status_table_description
source: A list of PRNs showing the current status.
cy: Rhestr o PRNs sy'n dangos y statws cyfredol.
