Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/CompanyDetailsSubmissionErrorCodes.*.resx
Languages: cy

source: Invalid File Format
cy: Fformat Ffeil Annilys

source: Csv File Is Empty
cy: Ffeil Csv yn Wag

source: Invalid Headers
cy: Penynnau Annilys

source: Enter the organisation ID
cy: Rhowch ID y sefydliad

source: Enter the organisation name
cy: Rhowch enw'r sefydliad

source: Enter the home nation code
cy: Rhoch god y wlad gartref

source: Home nation code must be one of EN NI SC or WS
cy: Rhaid i god y wlad gartref fod yn un o blith EN NI SC neu WS

source: Enter the first name of the primary contact
cy: Rhowch enw cyntaf y prif gyswllt

source: Enter the last name of the primary contact
cy: Rhowch enw olaf y prif gyswllt

source: Enter the email of the primary contact
cy: Rhowch ebost y prif gyswllt

source: Enter the phone number of the primary contact
cy: Rhowch rif ffôn y prif gyswllt

source: Enter the first line of the registered address
cy: Rhowch linell gyntaf y cyfeiriad cofrestredig

source: Enter the postcode for the registered address
cy: Rhowch god post y cyfeiriad cofrestredig

source: Enter the phone number for the registered address
cy: Rhowch rif ffôn y cyfeiriad cofrestredig

source: If you enter an audit address the country must be one of the following: EN, NI, SC, WS, UK, GB, England, Northern Ireland, Scotland, Wales, United Kingdom or Great Britain
cy: Os rhowch chi gyfeiriad archwilio, rhaid i'r wlad fod yn un o'r canlynol: EN NI SC WS UK GB Lloegr Gogledd Iwerddon yr Alban Cymru y Deyrnas Unedig neu Brydain Fawr

source: If you enter an audit address, it must include the first line of the address
cy: Os rhowch chi gyfeiriad archwilio rhaid iddo gynnwys llinell gyntaf y cyfeiriad

source: If you enter an audit address, it must include the postcode
cy: Os rhowch chi gyfeiriad archwilio rhaid iddo gynnwys y cod post

source: Enter the first line of the principal address
cy: Rhowch linell gyntaf y prif gyfeiriad

source: Enter the postcode for the principal address
cy: Rhowch god post y prif gyfeiriad

source: Enter the phone number for the principal address
cy: Rhowch rif ffôn y prif gyfeiriad

source: Cannot repeat combination of organisation ID and subsidiary ID
cy: Methu ailadrodd y cyfuniad o ID sefydliad ac ID is-gwmni

source: SIC code must be a 5 digit number - include zeros at the start if needed
cy: Rhaid i'r cod SIC fod yn rhif â 5 digid - cynhwyswch seroau ar y dechrau os oes eu hangen

source: Organisations must have one Primary packaging activity
cy: Rhaid i sefydliadau fod ag un Gweithgaredd pecynwaith sylfaenol

source: Organisations cannot have more than one Primary packaging activity
cy: Ni chaiff sefydliadau fod â mwy nag un Gweithgaredd pecynwaith sylfaenol

source: Packaging activity can only be Primary Secondary or No
cy: Gall y gweithgaredd pecynwaith fod yn Sylfaenol, Eilaidd neu Na yn unig

source: Enter the packaging activity - supplied under own brand
cy: Rhowch y gweithgaredd pecynwaith - wedi cyflenwi o dan eu brand eu hunain

source: Enter the packaging activity - packed or filled as unbranded
cy: Rhowch y gweithgaredd pecynwaith - wedi pacio neu wedi llenwi heb frand

source: Enter the packaging activity - imported
cy: Rhowch y gweithgaredd pecynwaith - wedi mewnforio

source: Enter the packaging activity - supplied as empty
cy: Rhowch y gweithgaredd pecynwaith - wedi cyflenwi yn wag

source: Enter the packaging activity - hired or loaned
cy: Rhowch y gweithgaredd pecynwaith - wedi llogi neu wedi benthyca

source: Enter the packaging activity - supplied through an online marketplace owned by the organisation
cy: Rhowch y gweithgaredd pecynwaith - wedi cyflenwi drwy farchnad ar-lein sy'n perthyn i'r sefydliad

source: Enter the packaging activity - selling
cy: Rhowch y gweithgaredd pecynwaith - gwerthu

source: Enter Yes or No - does the organisation put packaging on the market which has no brand names, identifying marks or trademarks?
cy: Rhowch Ydy neu Nac ydy - ydy'r sefydliad yn gosod pecynwaith ar y farchnad sydd heb enwau brand nodau adnabod neu nodau masnach?

source: Trading name must be different from organisation name
cy: Rhaid i'r enw masnachu fod yn wahanol i enw'r sefydliad

source: If you enter a service address, it must include the first line of the address
cy: Os rhowch chi gyfeiriad ar gyfer cyflwyno dogfennau rhaid iddo gynnwys llinell gyntaf y cyfeiriad

source: If you enter a service address, it must include the postcode
cy: Os rhowch chi gyfeiriad ar gyfer cyflwyno dogfennau rhaid iddo gynnwys y cod post

source: Organisation sub type is LIC POB FRA - this means you must enter details of another organisation with a sub type of LFR TEN or OTH
cy: Is-fath y sefydliad yw LIC POB FRA - mae hynny'n golygu bod rhaid ichi roi manylion sefydliad arall sydd ag is-fath LFR TEN neu OTH

source: If you enter a service address, it must include the phone number
cy: Os rhowch chi gyfeiriad ar gyfer cyflwyno dogfennau rhaid iddo gynnwys rhif ffôn

source: Turnover must not include a comma
cy: Chaiff y trosiant ddim cynnwys coma

source: Turnover must be in millions to two decimal places
cy: Rhaid i'r trosiant fod mewn miliynau hyd at ddau le degol

source: Turnover must be greater than 0
cy: Rhaid i'r trosiant fod yn fwy na 0

source: Turnover must only include numbers
cy: Rhaid i'r trosiant gynnwys rhifau yn unig

source: Companies House number cannot be 00000000
cy: Ni chaiff rhif Tŷ'r Cwmnïau fod yn 00000000

source: Companies House number not needed for this organisation type
cy: Does dim angen rhif Tŷ'r Cwmnïau ar gyfer y math yma o sefydliad

source: Companies House number does not match this organisation ID - check both
cy: Nid yw rhif Tŷ'r Cwmnïau yn cyfateb i ID y sefydliad yma - gwiriwch y ddau

source: Total tonnage must be greater than 0
cy: Rhaid i gyfanswm y tunelledd fod yn fwy na 0

source: Total tonnage must not include a comma
cy: Ni chaiff cyfanswm y tunelledd gynnwys coma

source: Total tonnage must only include numbers
cy: Rhaid i gyfanswm y tunelledd gynnwys rhifau yn unig

source: Enter the organisation type code
cy: Rhowch god y math o sefydliad

source: Organisation type code must be one of SOL PAR REG PLC LLP LTD LPA COP CIC OUT OTH
cy: Rhaid i god y math o sefydliad fod yn un o blith SOL PAR REG PLC LLP LTD LPA COP CIC OUT OTH

source: Check that the organisation ID is correct
cy: Gwiriwch fod ID y sefydliad yn gywir

source: Subsidiary ID does not exist. Check file and try again.
cy: Nid yw ID yr is-gwmni'n bodoli. Gwiriwch y ffeil a rhowch gynnig arall arni.

source: Subsidiary ID is assigned to a different organisation. Check file and try again.
cy: Mae ID yr is-gwmni wedi'i neilltuo i sefydliad arall. Gwiriwch y ffeil a rhowch gynnig arall arni.

source: Subsidiary ID does not belong to any organisation.
cy: Nid yw ID yr is-gwmni yn perthyn i unrhyw sefydliad.

source: This companies house number does not match the subsidiary ID.
cy: Nid yw rhif Tŷ'r Cwmnïau yn cyfateb i'r ID is-gwmni yma.

source: Organisation size must be S (Small) or L (Large).
cy: Dim ond bach neu fawr y gall maint y sefydliad fod.

source: Organisation size must be S (Small) or L (Large).
cy: Dim ond bach neu fawr y gall maint y sefydliad fod.

source: To qualify as a small producer, your most recent annual turnover must be £2 million or less, or your annual total tonnage must be 50 tonnes or less.
cy: I fod yn gymwys fel cynhyrchwr bach, rhaid i'ch trosiant blynyddol diweddaraf fod yn £2 filiwn neu lai, neu rhaid i gyfanswm eich tunelli blynyddol fod yn 50 tunnell neu lai.

source: To qualify as a large producer, your most recent annual turnover must be more than £2 million, and your annual total tonnage must be more than 50 tonnes.
cy: I fod yn gymwys fel cynhyrchydd mawr rhaid i'ch trosiant blynyddol mwyaf diweddar fod yn fwy na £2 miliwn a rhaid i gyfanswm eich tunelledd blynyddol fod yn fwy na 50 tunnell.

source: Joiner date must be in DD/MM/YYYY format.
cy: Rhaid i'r dyddiad ymuno fod ar y ffurf DD/MM/YYYY.

source: You must enter a leaver code for this subsidiary.
cy: Rhaid ichi roi cod ymadael ar gyfer yr is-gwmni yma.

source: You must enter a leaver date for this subsidiary.
cy: Rhaid ichi roi dyddiad ymadael ar gyfer yr is-gwmni yma.

source: Leaver date must be in DD/MM/YYYY format.
cy: Rhaid i'r dyddiad ymuno fod ar y ffurf DD/MM/YYYY.

source: The subsidiary leaver date must be later than the subsidiary joiner date.
cy: Rhaid i ddyddiad ymadael yr is-gwmni fod yn hwyrach na dyddiad ymuno'r is-gwmni.

source: Leaver reason must be present when leaver code is available.
cy: Rhaid i'r rheswm ymadael fod yn bresennol pan fo'r cod ymadael ar gael.

source: Organisation change reason cannot contain more than 200 characters.
cy: Ni chaiff rheswm dros newid sefydliad gynnwys mwy na 200 o gymeriadau.

source: Joiner date does not match joiner date in database.
cy: Nid yw'r dyddiad ymuno yn cyfateb i'r dyddiad ymuno yn y gronfa ddata.

source: Organisation change reason must only include numbers and letters.
cy: Rhaid i reswm newid y sefydliad gynnwys rhifau a llythrennau yn unig.

source: Leaver code must be a single capital letter between A and L.
cy: Rhaid i'r cod ymadael fod yn un briflythyren rhwng A ac Q.

source: Leaver date cannot be in the future.
cy: Ni chaiff y dyddiad ymadael fod yn y dyfodol.

source: Joiner date cannot be in the future.
cy: N chaiff y dyddiad ymuno fod yn y dyfodol.

source: You must enter a registration type code for this subsidiary.
cy: Rhaid ichi roi cod math cofrestru ar gyfer yr is-gwmni yma.

source: Registration type code must be either GR (for group registration) or IN (for individual registration).
cy: Rhaid i'r cod math cofrestru fod yn GR (ar gyfer cofrestru grŵp) neu IN (ar gyfer cofrestru unigol).

source: Enter a registration type code for this organisation.
cy: Rhowch god math cofrestru ar gyfer y sefydliad yma.

source: Enter a leaver code for this organisation.
cy: Rhowch god ymadael ar gyfer y sefydliad yma.

source: Enter a leaver date for this organisation.
cy: Rhowch ddyddiad ymadael ar gyfer y sefydliad yma.

source: The organisation's leaver date must be later than its joiner date.
cy: Rhaid i ddyddiad ymadael y sefydliad fod yn hwyrach na'i ddyddiad ymuno.

source: Turnover for this organisation is recorded as zero. Please verify this is correct before submitting a zero return
cy: Mae trosiant y sefydliad yma wedi'i gofnodi fel sero. Gwiriwch fod hyn yn gywir cyn ichi gyflwyno ffurflen sy'n dweud sero

source: Error
cy: Gwall

source: Warning
cy: Rhybudd

source: Total tonnage must be provided
cy: Rhaid darparu cyfanswm y tunelledd

source: Turnover must be provided
cy: Rhaid darparu’r trosiant
