Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/PrnCsvResources.*.resx
Languages: cy

# column_header_prn_or_pern_number
source: PRN or PERN number
cy: Rhif PRN neu PERN

# column_header_prn_or_pern
source: PRN or PERN
cy: PRN neu PERN

# column_header_status
source: Status
cy: Statws

# column_header_issued_by
source: Issued by
cy: Wedi'u rhoi gan

# column_header_issued_to
source: Issued to
cy: Wedi'u rhoi i

# column_header_accreditation_number
source: Accreditation number
cy: Rhif achredu

# column_header_date_issued
source: Date issued
cy: Dyddiad rhoi

# column_header_december_waste
source: December waste
cy: Gwastraff Rhagfyr

# column_header_material
source: Material
cy: Deunydd

# column_header_recycling_process
source: Recycling process
cy: Proses ailgylchu

# column_header_tonnes
source: Tonnes
cy: Tunelli

# column_header_date_accepted
source: Date accepted
cy: Dyddiad derbyn

# column_header_date_cancelled
source: Date cancelled
cy: Dyddiad canslo

# column_header_issuer_note
source: Issuer note
cy: Nodyn rhoddwr

source: not accepted
cy: heb ei derbyn

source: not cancelled
cy: heb ei chanslo

source: not provided
cy: heb ei ddarparu

source: Awaiting acceptance
cy: Yn aros i gael ei dderbyn

source: Accepted
cy: Wedi'i dderbyn

source: Cancelled
cy: Wedi'i ganslo

source: Rejected
cy: Wedi'i wrthod

# Yes
source: Y
cy: Ie

# No
source: N
cy: Nage

source: Select all that apply
cy: Dewiswch bob un sy'n berthnasol
