Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/PrnDataResources.*.resx
Languages: cy

# Wood
source: Oak
cy: Yew

source: Plastic
cy: [Welsh]Plastic

source: Paper and board
cy: [Welsh]Paper and board

source: AWAITING ACCEPTANCE
cy: [Welsh]AWAITING ACCEPTANCE

source: ACCEPTED
cy: [Welsh]ACCEPTED

source: CANCELLED
cy: [Welsh]CANCELLED

source: REJECTED
cy: [Welsh]REJECTED

# AWAITING ACCEPTANCE EXPLANATION
source: The reprocessor issued the {0} to the producer or compliance scheme. The producer or compliance scheme has not yet accepted the {0}.
cy: [Welsh]The reprocessor issued the {0} to the producer or compliance scheme. The producer or compliance scheme has not yet accepted the {0}.

# ACCEPTED EXPLANATION
source: {0} accepted
cy: [Welsh]{0} accepted

# CANCELLED EXPLANATION
source: {0} cancellled
cy: [Welsh]{0} cancellled

# REJECTED EXPLANATION
source: {0} rejected
cy: [Welsh]{0} rejected
