Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/ComplianceSchemeMemberLanding/ComplianceSchemeMemberLanding.*.resx
Languages: cy

# account_name_manager
source: Account home - {0}
cy: Hafan y cyfrif - {0}

source: submitting packaging data to the environmental regulator
cy: cyflwyno data pecynwaith i’r rheoleiddiwr amgylcheddol

source: reporting organisation details and keeping them up to date
cy: rhoi gwybod am fanylion y sefydliad a’u diweddaru

source: paying fees and charges to the environmental regulator
cy: talu ffioedd a thaliadau i’r rheoleiddiwr amgylcheddol

source: Change or remove compliance scheme
cy: Newid neu ddileu cynllun cydymffurfio

source: handling packaging waste recycling notes (PRNs) and packaging waste export recycling notes (PERNs) - these are evidence that packaging has been recycled, recovered or exported
cy: trin nodiadau ailgylchu gwastraff pecynwaith (PRNs) a nodiadau ailgylchu allforio pecynwaith gwastraff (PERNs) - mae’r rhain yn dystiolaeth bod gwastraff pecynwaith wedi’i adfer, wedi’i ailbrosesu neu wedi’i allforio

# compliance_scheme_name
source: Compliance scheme: {0}
cy: Cynllun cydymffurfio: {0}

# responsible_for
source: What is {0} responsible for
cy: Yr hyn y mae {0} yn gyfrifol amdano

# behalf_of_responsible_for
source: On behalf of {0}, {1} is responsible for:
cy: Ar ran {0}, mae {1} yn gyfrifol am y canlynol:

# what_they_are_responsible_for
source: What {0} is responsible for
cy: Yr hyn y mae {0} yn gyfrifol amdano

source: Paying fees and charges to the scheme administrator.
cy: talu ffioedd a thaliadau i weinyddwr y cynllun.

source: You can
cy: Gallwch chi

# change_or_remove_compliance_scheme_link
source: change or remove {0}â€™s compliance scheme
cy: newid neu ddileu cynllun cydymffurfio {0}

# organisation_id
source: Organisation ID: {0}
cy: ID y sefydliad: {0}

# waste_management_and_admin_fees
source: Waste management and admin fees (opens in a new tab)
cy: [WELSH]Waste management and admin fees (opens in a new tab)

# sign_into_the_financial_services_system
source: Sign into the financial services system (FSS) to view and manage the fees your organisation needs to pay.
cy: [WELSH]Sign into the financial services system (FSS) to view and manage the fees your organisation needs to pay.

# view_and_pay_waste_disposal_fees
source: View and pay waste disposal fees for packaging (opens in a new tab)
cy: Gweld a thalu ffioedd gwaredu gwastraff ar gyfer pecynwaith (yn agor mewn tab newydd)

# go_to_packuk
source: Go to PackUK (the scheme administrator for the Extended Producer Responsibility for packaging programme) to:
cy: Ewch i PecynUK (gweinyddwr y cynllun ar gyfer y rhaglen Cyfrifoldeb Estynedig Cynhyrchwyr dros becynwaith) i wneud y canlynol:

# pay_the_fees
source: pay the fees your organisation needs to pay
cy: Talu'r ffioedd y mae angen i'ch sefydliad eu talu

source: view previous payments
cy: Gweld taliadau blaenorol

# learn_more_about_packuk
source: Learn more about PackUK (opens in a new tab)
cy: Dysgu mwy am PecynUK (yn agor mewn tab newydd)
