Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/Prns/AcceptSinglePrn.*.resx
Languages: cy

source: Status
cy: [Welsh]Status

source: Status meaning
cy: [Welsh]Status meaning

source: Issued by
cy: [Welsh]Issued by

source: Reproccessing site
cy: [Welsh]Reproccessing site

source: Authorised by
cy: [Welsh]Authorised by

source: Accreditation number
cy: [Welsh]Accreditation number

source: Date issued
cy: [Welsh]Date issued

source: Relates to waste received in December?
cy: [Welsh]Relates to waste received in December?

source: Material
cy: [Welsh]Material

source: Tonnage
cy: [Welsh]Tonnage

source: Packaging producer or compliance scheme
cy: [Welsh]Packaging producer or compliance scheme

source: Note
cy: [Welsh]Note
