Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/Prns/SelectMultiplePrns.*.resx
Languages: cy

source: Accept or reject PRNs and PERNs
cy: Derbyn neu wrthod PRNs a PERNs

source: Accept selected PRNs and PERNs
cy: Derbyn y PRNs a'r PERNs sydd wedi'u dewis

# clear_sort_and_filter
source: Clear all
cy: Clirio'r cyfan

source: Date issued
cy: Dyddiad rhoi

source: December waste
cy: Gwastraff Rhagfyr

# filter_all_materials
source: All materials
cy: Pob deunydd

# filter_aluminium
source: Aluminium
cy: Alwminiwm

source: Filter by
cy: Hidlo yn ol

# filter_glass_other
source: Glass other
cy: Gwydr arall

# filter_glass_remelt
source: Glass re-melt
cy: Gwydr aildoddi

# filter_paper_board_fiber
source: Paper, board or fibre-based composite material
cy: Papur, bwrdd neu ddeunydd cyfansawdd sy'n seiliedig ar ffeibrau

# filter_plastic
source: Plastic
cy: Plastig

# filter_steel
source: Steel
cy: Dur

# filter_wood
source: Wood
cy: Pren

source: Issued by
cy: Wedi'i roi gan

# issued_by_asc
source: Issued by (A to Z)
cy: Wedi'u rhoi gan (A i Z)

# issued_by_desc
source: Issued by (Z to A)
cy: Wedi'u rhoi gan (Z i A)

source: Issuer note
cy: Nodyn rhoddwr

source: Material
cy: Deunydd

# note
source: Issuer note
cy: Nodyn cyhoeddwr

# page_title
source: Accept or reject PRNs and PERNs
cy: Derbyn neu wrthod PRNs a PERNs

source: PRN or PERN number
cy: Rhif PRN neu PERN

source: Select one or more PRNs or PERNs to accept them
cy: Dewiswch un neu ragor o PRNs neu PERNs i'w derbyn

# select_or_unselect_all_prns
source: Select or unselect all PRNs and PERNs
cy: Dewis pob PRN a PERN neu ddileu'r dewis

# select_the_prns_and_perns_you_want_to_accept
source: Select the PRNs and PERNs you want to accept. You can also review each one by opening it and selecting 'accept' or 'reject'.
cy: Dewiswch y PRNs a'r PERNs yr hoffech eu derbyn. Rydych chi hefyd yn gallu adolygu pob un drwy ei agor a dewis 'derbyn' neu 'gwrthod'.

source: Sort by
cy: Didoli yn Ã´l

# sort_date_issued_asc
source: Date issued (oldest first)
cy: Dyddiad rhoi (hynaf yn gyntaf)

# sort_date_issued_desc
source: Date issued (newest first)
cy: Dyddiad rhoi (diweddaraf yn gyntaf)

# sort_december_waste
source: December waste (yes to no)
cy: Gwastraff Rhagfyr (ie i nage)

# sort_tonnage_asc
source: Tonnage: (lightest first)
cy: Tunelli (ysgafnaf yn gyntaf)

# sort_tonnage_desc
source: Tonnage: (heaviest first)
cy: Tunelli (trymaf yn gyntaf)

source: Tonnage
cy: Tunelli

# view_and_select_prns_table_description
source: A list of PRNs and PERNs to select from.
cy: Rhestr o PRNs a PERNs i ddewis ohonynt.

source: Not provided
cy: Heb ei ddarparu

# checkboxes-hint
source: Please select the PRNs you wish to accept or reject.
cy: Dewiswch y PRNs yr hoffech eu derbyn neu eu gwrthod.
