Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/Prns/SelectSinglePrn.*.resx
Languages: cy

source: Status
cy: Statws

source: Status meaning
cy: Ystyr y statws

source: Issued by
cy: Wedi'i roi gan

source: Reproccessing site
cy: Safle ailbrosesu

source: Authorised by
cy: Wedi'i awdurdodi gan

source: Accreditation number
cy: Rhif achredu

source: Date issued
cy: Dyddiad rhoi

source: Relates to waste received in December?
cy: Gwastraff Rhagfyr?

source: Material
cy: Deunydd

source: Tonnage
cy: Tunelli

source: Packaging producer or compliance scheme
cy: Cynhyrchydd y pecynwaith neu'r cynllun cydymffurfio

source: Note
cy: Nodi

source: Year
cy: Blwyddyn Cyhoeddi'r

source: Packaging Recycling Note
cy: Nodyn Ailgylchu Pecynnu

source: Packaging Export Recycling Note
cy: Nodyn Ailgylchu Allforio Pecynnu

source: PRN number
cy: Rhif PRN

source: PERN number
cy: Rhif PERN

source: PRN details
cy: Manylion y PRN

source: PERN details
cy: Manylion y PERN

source: Accept this PRN
cy: Derbyn y PRN yma

source: Accept this PERN
cy: Derbyn y PERN yma

source: Reject this PRN
cy: Gwrthod y PRN yma

source: Reject this PERN
cy: Gwrthod y PERN yma

source: Download this PRN
cy: Lawrlwytho'r PRN yma fel PDF

source: Download this PERN
cy: Lawrlwytho'r PERN yma fel PDF

# this_prn_relates_to_waste_received_for_reprocessing_in_December
source: This PRN relates to waste received for reprocessing in December {0}.
cy: Mae'r PRN yma yn ymwneud â gwastraff a gafodd ei allforio i'w ailbrosesu ym mis Rhagfyr {0}.

# this_pern_relates_to_waste_exported_for_reprocessing_in_December
source: This PERN relates to waste exported for reprocessing in December {0}.
cy: Mae'r PERN yma yn ymwneud â gwastraff a gafodd ei allforio i'w ailbrosesu ym mis Rhagfyr {0}.

# page_title_pern
source: Accept this PERN
cy: Derbyn y PERN yma

# page_title_prn
source: Accept this PRN
cy: Derbyn y PRN yma
