Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/FileUploadCompanyDetailsSubLanding/FileUploadCompanyDetailsSubLanding.*.resx
Languages: cy

source: Report organisation details for
cy: Rhoi gwybod am fanylion sefydliad ar gyfer

# report_member_organisation_details_for
source: Report members’ organisation details for
cy: Rhoi gwybod am fanylion sefydliad aelodau ar gyfer

source: Before you start
cy: Cyn ichi ddechrau

source: Read the guidance on
cy: Darllenwch y canllawiau ar

# how_to_report_organisation_details
source: how to report organisation details (opens in a new tab)
cy: sut i roi gwybod am fanylion y sefydliad (yn agor mewn ffenestr newydd)

source: How to report
cy: Sut i roi gwybod

# keep_the_information_up_to_date
source: If you’ve missed a deadline, you may still be able to report without facing enforcement.
cy: Os ydych wedi methu terfyn amser, efallai y byddwch yn dal i allu adrodd heb wynebu gorfodaeth.

source: Upload organisation details
cy: Uwchlwytho manylion sefydliad

source: Large organisations
cy: Sefydliadau mawr

# deadline
source: Deadline: 11:59pm on
cy: Dyddiad cau: 11:59pm ar

# upload_file_to_your_account
source: Upload file to account
cy: Uwchlwytho ffeil i’r cyfrif

source: Not Started
cy: Heb Ddechrau

source: Uploaded
cy: Wedi’u huwchlwytho

# report_your_member_organisation_detail
source: Report your members’ organisation details
cy: Rhoi gwybod am fanylion eich sefydliad aelodau chi

source: Start now
cy: Dechrau nawr

# report_your_organisation_detail
source: Report your organisation details
cy: Rhoi gwybod am fanylion eich sefydliad chi

source: Report members’ details
cy: Rhoi gwybod am fanylion aelodau

source: Report organisation details
cy: Rhoi gwybod am fanylion sefydliad

source: Cannot Start Yet
cy: Methu Dechrau Eto

source: File Uploaded
cy: Ffeil wedi’i huwchlwytho

source: Submitted To Regulator
cy: Wedi’u cyflwyno i’r rheoleiddiwr

# tab_title
source: Report your organisation details - what to do
cy: Rhoi gwybod am fanylion eich sefydliad - beth i’w wneud

# if_youve_missed_a_deadline
source: If you’ve missed a deadline, you may still be able to report without facing enforcement action.
cy: Os ydych chi wedi colli dyddiad cau, mae’n dal yn bosibl y gallwch chi gyflwyno adroddiad heb wynebu camau gorfodi.

# check_the_govuk_guidance
source: Check GOV.UK guidance (opens in a new tab)
cy: Gwiriwch ganllaw GOV.UK (yn agor mewn tab newydd)

source: If you’ve missed a deadline to submit
cy: Os ydych chi wedi colli dyddiad cau cyflwyno

source: Your history
cy: Eich hanes

source: View your organisation data files
cy: Gweld ffeiliau data eich sefydliad

source: View submission history
cy: Gweld eich hanes cyflwyno

source: Accepted by Regulator
cy: Wedi'i dderbyn gan y Rheoleiddiwr

source: Approved By Regulator
cy: Cymeradwywyd gan y Rheoleiddiwr

source: Rejected by Regulator
cy: Wedi'i wrthod gan y Rheoleiddiwr

# inform
source: Report
cy: Rhoi manylion

# member_organisation_details
source: your members’ organisation details
cy: fanylion eich sefydliad aelodau chi

source: organisation details
cy: ar gyfer y sefydliad

# making_changes_after_april
source: Making changes to members registered after 1 April 2025
cy: Gwneud newidiadau i aelodau sydd wedi'u cofrestru ar ôl 1 Ebrill 2025

# you_must_report_changes
source: You must report any changes to us within 28 days
cy: Rhaid ichi roi gwybod inni am unrhyw newidiadau o fewn 28 diwrnod

# if_you_need_changes_after_april
source: If you need to make changes to members registered on or after 1 April 2025
cy: Os oes angen ichi wneud newidiadau i aelodau sydd wedi'u cofrestru ar neu ar ôl 1 Ebrill 2025

# registration_file_link
source: update and resubmit your registration file
cy: diweddarwch ac ailgyflwynwch eich ffeil gofrestru

# how_to_report_organisation_details_new_tab
source: how to report organisation details (opens in a new tab)
cy: sut i roi gwybod am fanylion y sefydliad (yn agor mewn tab newydd)

# check_the_govuk_guidance_new_tab
source: Check GOV.UK guidance (opens in a new tab)
cy: Gwiriwch y canllawiau ar GOV.UK (yn agor mewn tab newydd)

# if_youve_missed_a_deadline_without_action
source: If you’ve missed a deadline, you may still be able to report without facing enforcement.
cy: Os ydych chi wedi colli dyddiad cau, mae’n dal yn bosibl y gallwch chi gyflwyno adroddiad heb wynebu camau gorfodi.

# making_changes_after_april_2025
source: Making changes after 1 April 2025
cy: Gwneud newidiadau ar ôl 1 Ebrill 2025

# if_you_need_to_make_changes_after_april_2025
source: If you need to make changes registered on or after 1 April 2025,
cy: Os oes angen ichi wneud newidiadau sydd wedi'u cofrestru ar neu ar ôl 1 Ebrill 2025,

# update_and_resubmit_registration_file
source: update and resubmit your registration file.
cy: diweddarwch ac ailgyflwynwch eich ffeil gofrestru.

# you_must_report_changes_within_28_days
source: You must report any changes to us within 28 days.
cy: Rhaid ichi roi gwybod inni am unrhyw newidiadau o fewn 28 diwrnod.

# adding_or_removing_members_affect_packaging_obligations
source: Adding or removing members might affect your organisation's packaging obligations - make sure you have read the
cy: Gallai ychwanegu neu dynnu aelodau effeithio ar rwymedigaethau pecynwaith eich sefydliad – gofalwch eich bod wedi darllen y

# guideline_for_extended_producer_responsibility_link
source: guidelines for extended producer responsibility for packaging (opens in a new tab).
cy: canllawiau ynghylch cyfrifoldeb estynedig cynhyrchwyr dros becynwaith (yn agor mewn tab newydd).

# ConfirmationOfRemoval.AddingOrRemovingMembers
source: Adding or removing members might affect your organisation's packaging<br />obligations - make sure you have read the
cy: Gallai ychwanegu neu dynnu aelodau effeithio ar rwymedigaethau pecynwaith eich sefydliad – gofalwch eich bod wedi darllen y

# ConfirmationOfRemoval.GuidelinesForExtendedProducer
source: guidelines for extended producer<br />responsibility for packaging (opens in a new tab).
cy: canllawiau ynghylch cyfrifoldeb estynedig cynhyrchwyr dros becynwaith (yn agor mewn tab newydd).
