Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/Shared/_ComplianceSchemeFeeCalculationBreakdown.*.resx
Languages: cy

# item
source: Items
cy: Eitem

source: Description
cy: Disgrifiad

source: Amount
cy: Swm

source: Application fee
cy: Ffi ymgeisio

source: Compliance scheme
cy: Cynllun cydymffurfio

# x_online_marketplaces_sentence_text
source: {0} are online marketplaces
cy: Mae {0} yn farchnadoedd ar-lein

# x_online_marketplaces_sentence_text_singular
source: {0} is an online marketplace
cy: Mae {0} yn farchnad ar-lein

source: Scheme Members
cy: Aelodau'r cynllun

# sub_total_amount
source: Sub-total
cy: Is-gyfanswm

source: Previous payments
cy: Taliadau blaenorol

# total_previous_payments_received
source: Total payments received
cy: Cyfanswm y taliadau sydd wedi dod i law

source: Total Outstanding
cy: Y cyfanswm sydd heb ei dalu
