Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/Shared/_FeeCalculationBreakdown.*.resx
Languages: cy

# item
source: Items
cy: Eitem

source: Description
cy: Disgrifiad

source: Amount
cy: Swm

source: Application fee
cy: Ffi prosesu’r cais

# fee_for_producer_size
source: {0} organisation registration fee
cy: Ffi ar gyfer cynhyrchydd {0}

source: Late fee
cy: WLate fee

source: Online marketplace fee
cy: Ffi marchnad ar-lein

source: Subsidiary fee
cy: Ffi is-gwmni

# x_subsidiaries
source: {0} subsidiaries
cy: {0} o is-gwmnïau

# y_online_marketplace
source: {0} are online marketplaces
cy: Mae {0} yn farchnadoedd ar-lein

source: Subsidiaries with online marketplace fee
cy: Ffi is-gwmnïau gyda marchnad ar-lein

# fee_for_subsidiaries_being_online_marketlace
source: {0} subsidiaries being an online marketplace at £2,579 each
cy: {0} is-gwmnïau sy’n farchnad ar-lein am £2,579 yr un

# sub_total_amount
source: Sub-total
cy: Is-gyfanswm

source: Previous payments
cy: Taliadau blaenorol

# total_previous_payments_received
source: Total payments received
cy: Cyfanswm y taliadau blaenorol sydd wedi dod i law’r rheoleiddiwr

# x_subsidiaries_singular
source: {0} subsidiary
cy: {0} is-gwmni

# y_online_marketplace_singular
source: {0} is on online marketplace
cy: {0} is on online marketplace Mae {0} ar y farchnad ar-lein
