Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/ResubmissionApplication/ResubmissionConfirmation.*.resx
Languages: cy

# resubmission_confirm_title
source: Resubmission confirmation
cy: WResubmission confirmation

# submitted_date_x
source: Submitted {0}
cy: Wedi’i gyflwyno {0}

source: Your packaging data has been resubmitted to the environmental regulator
cy: Mae'ch data pecynwaith wedi'i ailgyflwyno i'r rheoleiddiwr amgylcheddol

source: You've submitted your packaging data to the Environment Agency, the environment regulator for England.
cy: Rydych chi wedi cyflwyno'ch data pecynwaith i Asiantaeth yr Amgylchedd, sef rheoleiddiwr amgylcheddol Lloegr.

source: You can
cy: Gallwch

# print_record
source: print
cy: argraffu

# download_confirmation_as_PDF
source: download a confirmation as a PDF
cy: cadarnhad neu ei lawrlwytho fel PDF.

# it_will_open_in_a_new_window_or_tab
source: It will open in a new window or tab, or save to your downloads, depending on your browser.
cy: WIt will open in a new window or tab, or save to your downloads, depending on your browser.

source: What happens next
cy: Beth sy’n digwydd nesaf

source: You will receive an email after the environment regulator reviews your submission.
cy: Fe gewch chi neges ebost ar ôl i'r rheoleiddiwr amgylcheddol adolygu'ch cyflwyniad.

source: You can only make changes to your packaging data files after they've been reviewed.
cy: Dim ond ar ôl iddyn nhw gael eu hadolygu y cewch chi wneud newidiadau yn eich ffeiliau data pecynwaith.

source: Visit your
cy: Ewch i

source: account home page
cy: dudalen hafan eich cyfrif

# check_status_of_your_application
source: to check the status of your application.
cy: i wirio statws eich cais.

source: Give feedback
cy: [wales]Give feedback

source: Take an optional survey to help us improve this service.
cy: [wales]Take an optional survey to help us improve this service.
