Repository: DEFRA/epr-packaging-frontend
Catalog: src/FrontendSchemeRegistration.UI/Resources/Views/SubsidiaryConfirmCompanyDetails/SubsidiaryConfirmCompanyDetails.*.resx
Languages: cy

# ConfirmCompanyDetails.Address
source: Registered address
cy: Cyfeiriad cofrestredig

# ConfirmCompanyDetails.CompaniesHouseNumber
source: Companies number
cy: Rhif Tŷ’r Cwmnïau

# ConfirmCompanyDetails.Header
source: Confirm subsidiary details
cy: Cadarnhau manylion is-gwmni

# ConfirmCompanyDetails.Title
source: Confirm subsidiary details
cy: Cadarnhau manylion is-gwmni

# ConfirmCompanyDetails.IsAlreadyLinkedTo
source: {0} is already linked to
cy: Mae {0} eisoes wedi’i gysylltu â

# ConfirmCompanyDetails.CompanyNumber
source: Company number
cy: Rhif y cwmni

# ConfirmCompanyDetails.SearchAgain
source: Search again
cy: Chwilio eto

# ConfirmCompanyDetails.TheseDetailsAreWrong
source: These details are wrong
cy: Mae'r manylion yma yn anghywir

# ConfirmCompanyDetails.IfTheseDetails
source: If these details are wrong, you should
cy: Os yw'r manylion yma yn anghywir, fe ddylech chi:

# ConfirmCompanyDetails.CheckTheCompaniesHouseNumber
source: check the Companies House number and make sure it's accurate - if you entered it incorrectly, you can
cy: gwirio rhif Tŷ'r Cwmnïau a sicrhau ei fod yn gywir – os ydych chi wedi’i deipio’n anghywir, gallwch

# ConfirmCompanyDetails.ChangeYourNumber
source: change your number
cy: newid eich rhif

# ConfirmCompanyDetails.CheckCompaniesHouse
source: check Companies House to see if your organisation details are correct, if they are not
cy: gwirio Tŷ'r Cwmnïau i weld a yw manylion eich sefydliad yn gywir. Os nad ydyn nhw,

# ConfirmCompanyDetails.YouCanChangeThem
source: you can change them on Companies House (opens in a new tab)
cy: gallwch eu newid ar wefan Tŷ'r Cwmnïau (yn agor mewn tab newydd)

# ConfirmCompanyDetails.Cancel
source: Cancel
cy: Canslo

# ConfirmCompanyDetails.IsAlreadyLinkedToOtherParent
source: {0} is already linked to another producer
cy: Mae {0} eisoes wedi’i gysylltu â
